app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
	def index
		@months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']
		@company = Company.new
		@companies = Company.all

INSERT INTO "companies" ("created_at", "dateApplied", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-04-20 02:41:42.983472"], ["dateApplied", "123"], ["name", "asdf"], ["updated_at", "2014-04-20 02:41:42.983472"]]
---
	def create
		@company = Company.new(company_params)
		@company.save